Repository: pjq/ChitChat
Catalog: lib/l10n/app_*.arb
Languages: bn, hi

source: Assistants
bn: সহযোগীগণ
hi: सहायक

source: Edit prompt
bn: পরাম্পট সম্পাদনা করুন
hi: प्रॉम्प्ट संपादित करें

# delete_prompt_confirmation
source: The prompt and the related messages will be deleted
bn: পরাম্পট এবং সম্পর্কিত সকল বার্তা মুছে ফেলা হবে
hi: प्रॉम्प्ट और संबंधित संदेश हटा दिए जाएंगे

# delete_all_messages_confirmation
source: All messages in current channel will be deleted
bn: বর্তমান চ্যানেলে সমস্ত বার্তা মুছে ফেলা হবে
hi: वर्तमान चैनल में सभी संदेश हटा दिए जाएंगे।

source: Title
bn: শিরোনাম
hi: शीर्षक

source: Content
bn: বিষয়বস্তু
hi: सामग्री

source: Category
bn: বিভাগ
hi: श्रेणी

source: Cancel
bn: বাতিল
hi: रद्द करें

source: Save
bn: সংরক্ষণ
hi: सहेजें

# about
source: About the Application
bn: অ্যাপ্লিকেশন সম্পর্কে
hi: एप्लिकेशन के बारे में

# translation_review_title
source: Translation Review Expert
bn: অনুবাদ পর্যবেক্ষক
hi: अनुवाद समीक्षा विशेषज्ञ

# word_class_engineer_title
source: World Class Engineer
bn: বিশ্ব শ্রেণীর প্রকৌশলী
hi: विश्व स्तरीय इंजीनियर

source: Prompt {number}
bn: পরাম্পট {number}
hi: प्रॉम्प्ट {number}

# default_prompt_category
source: Default
bn: ডিফল্ট
hi: डिफ़ॉल्ट

source: Assistant
bn: সহযোগী
hi: सहायक

source: Type a message
bn: একটি বার্তা টাইপ করুন
hi: एक संदेश टाइप करें

source: Settings
bn: সেটিংস
hi: सेटिंग्स

source: Settings saved
bn: সেটিংস সংরক্ষিত হয়েছে
hi: सेटिंग्स सहेजी गई

source: OpenAI API Key
bn: OpenAI API কী
hi: OpenAI API कुंजिका

source: Prompt String
bn: পরাম্পট স্ট্রিং
hi: प्रॉम्प्ट स्ट्रिंग

# temperatureValue
source: Temperature Value(0-1.0)
bn: তাপমাত্রা মান (0-1.0)
hi: तापमान मान (0-1.0)

# selectModel
source: Select AI Model
bn: AI মডেল নির্বাচন করুন
hi: AI मॉडल का चयन करें

source: Continue Conversation
bn: কথোপকথন চালিয়ে যান
hi: बातचीत जारी रखें

source: Local Cache
bn: স্থানীয় ক্যাশ
hi: स्थानीय कैश

# enableTts
source: Enable TTS(Text to Speech)
bn: টিটিএস (টেক্সট টু স্পিচ) সক্ষম করুন
hi: TTS (टेक्स्ट से बोलने) सक्षम करें

# ttsLanguage
source: Text to Speech Language
bn: টিটিএস ভাষা
hi: टेक्स्ट से बोलने की भाषा

# sttLanguage
source: Speech to Text Language
bn: স্পিচ টু টেক্সট ভাষা
hi: बोलने से टेक्स्ट की भाषा

source: Clear Chat History
bn: চ্যাটের ইতিহাস মুছে ফেলুন
hi: चैट इतिहास साफ़ करें

# proxyUrl
source: Proxy(host:port)
bn: প্রক্সি (হোস্ট:পোর্ট)
hi: प्रॉक्सी (होस्ट: पोर्ट)

source: Settings saved
bn: সেটিংস সংরক্ষিত হয়েছে
hi: सेटिंग्स सहेजी गईं

# conversationRecordsErased
source: Conversation records erased, you may restart the App.
bn: কথোপকথনের রেকর্ড মুছে ফেলা হয়েছে, আপনি অ্যাপটি পুনরায় চালাতে পারেন।
hi: बातचीत रिकॉर्ड मिटाए गए, आप ऐप को फिर से शुरू कर सकते हैं।

# noTtsLanguagesAvailable
source: No languages available
bn: কোন ভাষা উপলব্ধ নয়
hi: कोई भाषाएं उपलब्ध नहीं हैं

# noSttLanguagesAvailable
source: No languages available
bn: কোন ভাষা উপলব্ধ নয়
hi: कोई भाषाएं उपलब्ध नहीं हैं

source: OpenAI API key not set
bn: OpenAI API কী নেই
hi: OpenAI API कुंजिका सेट नहीं है

# kindly_configure_openai_api_key
source: Kindly configure the OpenAI API key in the settings
bn: সেটিংস এ কৃপয়া করে OpenAI API কী কনফিগার করুন
hi: कृपया सेटिंग में OpenAI API कुंजिका कॉन्फ़िगर करें।

source: OK
bn: ঠিক আছে
hi: ठीक है

source: Failed to send message
bn: বার্তা পাঠানো ব্যর্থ হয়েছে
hi: संदेश भेजने में विफल रहा

source: Retry
bn: আবার চেষ্টা করুন
hi: पुन: प्रयास करें

source: Conversation records erased
bn: কথোপকথনের রেকর্ড মোছা হয়েছে
hi: बातचीत रिकॉर्ड मिटाए गए

source: Copy
bn: কপি
hi: कॉपी करें

source: Share
bn: শেয়ার
hi: साझा करें

source: Translation
bn: অনুবাদ
hi: अनुवाद

source: Rephrase
bn: পুনরায় কথায় আনুন
hi: फिर शब्दों में कहें

source: Delete
bn: মুছে ফেলুন
hi: हटाएं

source: version
bn: সংস্করণ
hi: संस्करण

source: year
bn: বছর
hi: वर्ष

source: Changelog
bn: পরিবর্তন তালিকা
hi: परिवर्तन लॉग

source: Copied to clipboard
bn: ক্লিপবোর্ডে কপি করা হয়েছে
hi: क्लिपबोर्ड पर कॉपी हो गया

source: Code copied to clipboard
bn: কোড ক্লিপবোর্ডে কপি করা হয়েছে
hi: कोड क्लिपबोर्ड पर कॉपी हुआ

source: Message deleted
bn: বার্তা মুছে ফেলা হয়েছে
hi: संदेश हटाए गए

source: Enable Stream Mode
bn: স্ট্রিম মোড সক্ষম করুন
hi: स्ट्रीम मोड सक्षम करें

# enable_enterkey_to_send
source: Press Enter Key to send
bn: পাঠান Enter চাবি চাপুন
hi: भेजने के लिए एंटर कुंजी दबाएं

# switch_between_openai_btp
source: You are able to alternate between OpenAI and BTP Service.
hi: आप ओपनएआई और बीटीपी सेवा के बीच टॉगल कर सकते हैं।

# paste_your_btp_key
source: Insert your BTP key.json
hi: अपना BTP कुंजी.json संलग्न करें
